[
    {
        "role":"Gen AI Platform Lead",
        "company":"Aviva",
        "summary": "Currently serving as a Technical Lead within Aviva’s Central Generative AI Platform Team, responsible for architecting, designing, and building centralised Generative AI capabilities and services to enable organisation-wide adoption and utilisation.\n\nCore responsibilities include:\n\n**Platform Development:**\n- Architected, designed, and developed containerised OpenAPI micro-services using Python, FastAPI, and the LangChain framework, integrating with AWS services such as DynamoDB, S3, SQS, and Elasticache (Redis).\n- Designed a standardised framework for business application teams, streamlining the development and deployment of internal Generative AI applications.\n- Developed a multi-cloud platform architecture supporting access to AWS Bedrock, Azure OpenAI Services, self-hosted Hugging Face models, and third-party tools like Snowflake.\n\n**Research and Development:**\n- Conducted proof-of-concept and R&D initiatives for future AI capabilities, including AI Agents, automated evaluation services, and third-party tool integrations.\n\n**Infrastructure and Deployment:**\n- Developed Terraform-based Infrastructure as Code (IaC) to provision and manage resources across AWS, Azure, and EKS clusters hosting platform services and applications.\n- Designed and implemented Azure DevOps pipelines for infrastructure management, container builds, automated testing, and validation processes.\n\n**Monitoring and Observability:**\n- Implemented a standardised Datadog setup for monitoring logs, APM, and metrics across hosting infrastructure, platform components, and applications.\n\n**Platform Features and Tools:**\n- Delivered services such as LLM inference capabilities, vector database indexes for RAG use cases, document analysis (e.g. AWS Textract), and platform management tools for observability, financial reporting, and testing/evaluation.\n\nThis role has combined technical expertise, strategic vision, and hands-on development to enable scalable, efficient, and innovative AI solutions across the organisation.",
        "range":"October 2023 - Present"
    },
    {
        "role":"Central Tools Platform Lead",
        "company":"Aviva",
        "summary":"Served as the Technical Lead for Aviva’s Central Software Engineering Services team, overseeing the management and optimisation of key software development tools and processes, including Azure DevOps, Jira, Confluence, and SonarQube. Developed subject matter expertise in the tools managed by the team, with a primary focus on leading the migration of Aviva’s software development tools from on-premises third-party hosting to AWS. This migration also involved re-platforming the tools as containerised deployments on Kubernetes.\n\nKey contributions include:\n\n**Cloud Migration and Platform Design:**\n- Architected scalable, resilient, and highly available cloud solutions, navigating Aviva’s gatekeeping and governance processes to ensure compliance and approval.\n- Designed and built a Kubernetes platform within AWS using Packer and Ansible for configuration and automation of infrastructure provisioning with Terraform.\n\n**Security and Compliance:**\n- Implemented comprehensive security hardening measures across Linux, Docker, and Kubernetes, adhering to CIS Benchmarks, SELinux policies, Pod Security, and Network Policies, and establishing robust RBAC configurations.\n- Designed a secure GitOps-based deployment process leveraging FluxCD for container workload management and Kustomize for workload definitions, alongside source control policy enforcement.\n\n**Day-2 Operations and Monitoring:**\n- Developed operational features for the platform, including centralised logging with Fluentd and Elasticsearch, and monitoring solutions using Prometheus, AlertManager, and Grafana.\n- Established a secure container image build pipeline with integrated image scanning via Aqua Security.\n\nThis role required strong leadership, deep technical expertise, and collaboration across multidisciplinary teams to deliver robust, secure, and scalable solutions that transformed Aviva’s software engineering capabilities.",
        "range":"May 2018 - October 2023"
    },
    {
        "role":"Software Developer",
        "company":"Aviva",
        "summary":"Contributed as a core member of the Life Protection Presentation Layer development team, with a focus on solving complex, new, and challenging problems. Played a pivotal role in delivering innovative solutions for both B2B and consumer-facing projects.\n\nKey contributions include:\n\n**Presentation Layer Development:**\n- Developed the B2B Protection solution for advisers on the ALPS platform using SS/G, including the adviser tracking system.\n- Delivered consumer protection solutions for Aviva and partner brands using the ALPS platform.\n- Designed and implemented a custom push notification system for automated email alerts to registered advisers regarding their ALPS applications, leveraging direct SS/G database queries to extract relevant data.\n\n**Cloud Migration Leadership:**\n- Led the team’s cloud migration activities, including developing Infrastructure as Code (IaC) for application hosting environments using Terraform and CloudFormation, incorporating Auto Scaling Groups (ASGs), EC2 instances, Application Load Balancers (ALBs), and AWS Lambda.\n- Created automated provisioning pipelines with Puppet modules for EC2 setup, Packer scripts for building AWS AMIs, and Jenkins pipelines for end-to-end environment provisioning.\n- Developed and implemented DevOps processes to automate regular builds, environment recreation, and application and configuration releases.\n\nThis role demanded strong problem-solving skills, deep technical expertise, and an ability to drive innovation across cloud and application development projects, ensuring seamless delivery of robust and scalable solutions.",
        "range":"October 2014 - May 2018"
    },
    {
        "role":"Senior Java Developer / Analyst",
        "company":"The British Library",
        "summary":"Served as the Technical Lead and Architect within a dedicated Java development team, responsible for delivering technical support and developing new solutions for the Libraries’ commercial document supply services. Key projects and contributions include:\n\n**API Development:**\n- Designed and developed a suite of RESTful APIs for the document supply system using Groovy and Grails, facilitating authentication, search, pricing, availability information, ordering, and management functionalities.\n\n**User Interface Redesign:**\n- Led the design and implementation of a new user interface for the document supply system, replacing the legacy Adobe Flex-based version with a mobile-compatible, modern interface.\n\n**Asynchronous Processing System:**\n- Architected and developed a high-performance, scalable asynchronous request processing system using Apache Camel and Apache ActiveMQ, replacing an outdated legacy system that processed free-text order requests submitted via email.\n\n**Application Development:**\n- Developed several Java and Grails applications, including a content retrieval service to access digital content from multiple repositories, and an availability module to provide real-time stock availability based on customer permissions and item statuses.\n\n**Data Migration & Metadata Enrichment:**\n- Designed and implemented a metadata export and migration system to transition over 40 million article records from a legacy text retrieval database to an MSSQL database. The process involved metadata enrichment to link records to other metadata repositories and creating Dublin Core XML exports for integration into the Libraries’ main content discovery system.\n\nThis role required a blend of technical leadership, architectural design, and hands-on development to drive impactful solutions and ensure the ongoing evolution of the Libraries’ document supply services.",
        "range":"September 2008 - October 2014"
    },
    {
        "role":"Java Developer",
        "company":"Merisis Technology LTD",
        "summary":"Developed J2EE web application solutions for IBM WebSphere Application Server and WebSphere Portal, utilizing DB2 databases. Played an integral role throughout the full Software Development Life Cycle (SDLC), collaborating with customers to gather requirements, define technical solutions, configure environments, and oversee deployment across multiple environments.",
        "range":"June 2006 - September 2008"
    },
    {
        "role":"ABAB Developer",
        "company":"ARCO LTD.",
        "summary":"Developed ABAP programs and reports for the companies SAP R/3 system.",
        "range":"September 2005 - June 2006"
    }
]
