[
    {
        "role":"Technical Services Specialist",
        "company":"Aviva",
        "summary":"I am the technical lead for the central Aviva Software Engineering Services team which is responsible for managing the central software development tools and processes including Jenkins, Azure DevOps, Jira, Confluence, Bitbucket, Checkmarx, SonarQube, XL Release and Service Virtualisation.\n During my time working for the team I have become an SME in most of the tools and applications being managed, however the majority of my focus has been on leading the migration of Aviva's tools to AWS, specifically as containerised deployments to Kubernetes clusters. This has involved:\n- Designing, building via Packer and Ansible and automating the provisioning via Terraform of a Kubernetes platform within AWS on EC2 instances, whilst working within the confines of Aviva's cloud platform controls and restictions.\n- Instrumenting security hardening to all aspects of the platform including Linux, Docker and Kubernetes CISCAT recomendations, SELinux policies, Pod Security and Network Policies along with suitable RBAC.\n- Design and implementation of a secure GitOps deployment process for container workloads through the use of Flux and source control management policy enforcement for deployment and Kustomize for workoad definition\n- Developing day 2 platform operations features such as logging via Fluentd to Elasticsearch and monitoring with Prometheus, Alert Manager and Grafana.\n- Building a secure container image build process including image scanning via Aquasec.\n\nThe current Software Engineering services container platform is now in production with the majority of the teams tools running as containerised workloads including two of Aviva's largest stateful applications, Jira and Confluence.\n\nMy current focus however is now on Aviva's other Kubernetes container platform that was built by Aviva's Digital team and is Rancher based. I have the current role of technical lead for that platform with a goal of merging the two container platforms into a single platform that can be rolled out across the rest of the organisation.",
        "range":"May 2018 - Present"
    },
    {
        "role":"Software Developer",
        "company":"Aviva",
        "summary":"I worked as a member of the Life Protection presentation layer development team. My main role within the team was that of the problem solver, where I tended to get involved in anything new and unknown or particularly challenging. Some of the presentation layer projects I was involved in:\n\n- Development of the B2B Protection solution for advisers using the ALPS platform and SS/G, including development of the adviser tracking solution.\n- Development of Consumer Protection solutions, both Aviva and partner branded, using the ALPS plaform.\n- Development of a custom “push notifications” system for sending out automated emails to registered advisers, of alerts and notifications relating to their current ALPS applications. This utilized direct SS/G database querying to extract the relevant data.\n\nI also led on the teams' cloud migration activity where I:\n\n- Developed infrastructure as code scripts to define environments using tools such as Terraform and Cloud formation.\n- Developed a suite of puppet modules to allow automated provisioning of various technologies including Jboss, Splunk forwarding and AppDynamics agents, along with associated 'role' and 'profile' modules that leveraged Hiera and configuration as code to build environment and application specific provisioning.\n- Developed various Packer and Vagrant scripts for building AWS AMI's and providing a means to automate instance creation.\n- Developed a fully automated Jenkins platform that can be torn down and rebuilt from scratch including automated provisioning of all jobs and pipelines. Including jobs to rebuild our engineering environment on a nightly basis with the latest in application and provisioning code.\n- Developed a release process to allow both application and provisioning versioning and the associated promotion through the environments in an automated yet audit-able and approved process.",
        "range":"October 2014 - May 2018"
    },
    {
        "role":"Senior Java Developer / Analyst",
        "company":"The British Library",
        "summary":"I was a member of a dedicated Java development team that provided ongoing technical support for the Libraries commercial document supply services as well as being the development team for new technical solutions. I was the teams’ technical leads and architect. Some of the projects I was involved in include:\n\n- Designed and developed a RESTful API (http://apitest.bldss.bl.uk/docs) for the libraries document supply system using Groovy and Grails. This provided authentication via a custom OAuth type solution and provided functionality for searching, retrieving pricing and availability information as well as ordering and management.\n- Led the design and implementation of a new user interface for the libraries document supply system (https://ondemand.bl.uk/onDemand/home), rewriting the existing Adobe Flex based version and built to be mobile compatible. It was powered by the document supply service API which underwent further development to provide the required functionality, as well as the creation of a Java client library and Grails Plugin to facilitate interaction with the API.\n- Designed and developed a scalable, high performance asynchronous request processing system using Apache Camel and Apache ActiveMQ to process what are essentially free text order requests submitted as emails, as a replacement for the existing legacy system.\n- Developed of a number of Java and Grails applications such as a content retrieval service to retrieve digital content from various repositories; an availability module to provide up to date availability details for stock items based on customer permissions and item statuses; a SOAP web service to integrate separate legacy SOAP web services routing requests.\n- Development of a metadata export and migration system to migrate the Libraries 40+ million article records from a legacy text retrieval database to an MSSQL database. This included metadata enrichment processes to link the data to other existing metadata repository records. This included an export process as Dublin Core XML for ingestion by the Libraries main content discovery system.",
        "range":"September 2008 - October 2014"
    },
    {
        "role":"Java Developer",
        "company":"Merisis Technology LTD",
        "summary":"I developed J2EE web application solutions for IBM Web Applicaton Server and Websphere Portal utililzing DB2 Databases. I was involved in the full SDLC, working with customers to determine requirements, develop solutions, build and configure environments and deployment.",
        "range":"June 2006 - September 2008"
    },
    {
        "role":"ABAB Developer",
        "company":"ARCO LTD.",
        "summary":"Developed ABAP programs and reports for the companies SAP R/3 system.",
        "range":"September 2005 - June 2006"
    }
]
